[{"title": "uber freight expands app to canada", "description": "uber freight the uber business unit that helps truck drivers connect with shipping companies said wednesday it s launching the app in canada as part of its global expansion plan the move into canada will give uber freight access to the country s 68 billio ", "author": "Kirsten Korosec", "content": "Uber Freight, the Uber business unit that helps truck drivers connect with shipping companies, said Wednesday it’s launching the app in Canada as part of its global expansion plan.\r\nThe move into Canada will give Uber Freight access to the country’s $68 billi… [+2181 chars]"}, {"title": "canada votes today here s what you need to know", "description": "prime minister justin trudeau faces the political battle of his life in a tight race ", "author": "Ian Austen and Dan Bilefsky", "content": "Mr. Scheers authenticity was also challenged when it emerged during the campaign that he has also held United States citizenship most of his life.\r\nJagmeet Singh, the 40-year-old leader of the N.D.P., made history as the first nonwhite person to lead a major … [+1008 chars]"}, {"title": "should you book a flight through an airline you ve never heard of ", "description": "in your quest to find an especially great deal for a flight you ll likely come across airlines that seem made up take bearskin airlines for example which operates out of ontario canada and is very real or chair airlines a swiss airline that flies throug ", "author": "Josh Ocampo", "content": "In your quest to find an especially great deal for a flight, youll likely come across airlines that seem made uptake Bearskin Airlines, for example, which operates out of Ontario, Canada and is very real. Or Chair Airlines, a Swiss airline that flies througho… [+4057 chars]"}, {"title": "justice department sues california over air pollution agreement with canada", "description": "the justice department sued california on wednesday claiming that the state bypassed federal authority when it entered into an environmental agreement with the canadian province of quebec to combat air pollution ", "author": "David Shortell, CNN", "content": "Washington (CNN)The Justice Department sued California on Wednesday, claiming that the state bypassed federal authority when it entered into an environmental agreement with the Canadian province of Quebec to combat air pollution. \r\nIn a complaint filed in Cal… [+2123 chars]"}, {"title": "justin trudeau humbled gets a second chance", "description": "he survived scandal and self inflicted wounds but will have to lead canada as part of a coalition with progressive parties ", "author": "The Editorial Board", "content": "Justin Trudeaus victory in Canadas national elections on Monday followed what he called one of the nastiest campaigns in Canadian history. That may be true, to the degree that much of the campaign was about him and some bad decisions he made, and it featured … [+1505 chars]"}, {"title": "fabric raises 110 million series b to expand its network of automated fulfillment centers in the u s ", "description": "fabric the startup that wants to make automated logistics available to retailers of all sizes announced today it has raised 110 million in series b funding the round was led by corner ventures with participation from aleph canada pension plan investment ", "author": "Catherine Shu", "content": "Fabric, the startup that wants to make automated logistics available to retailers of all sizes, announced today it has raised $110 million in Series B funding. The round was led by Corner Ventures, with participation from Aleph, Canada Pension Plan Investment… [+3387 chars]"}, {"title": "canadian therapist gives up license after satanists expose her mind control talks", "description": "activists with the satanic temple say a now former therapist in canada has been pushing conspiracies about globe spanning mind controlling cults for years and after they exposed some of her professional talks to her licensing board she voluntarily gave up ", "author": "Ed Cara", "content": "Activists with The Satanic Temple say a now-former therapist in Canada has been pushing conspiracies about globe-spanning, mind-controlling cults for years. And after they exposed some of her professional talks to her licensing board, she voluntarily gave up … [+11388 chars]"}, {"title": "air canada staff will no longer greet ladies and gentlemen onboard planes ctv news", "description": "air canada staff will no longer greet ladies and gentlemen onboard planes ctv news air canada drops ladies and gentlemen for gender neutral everyone news com au air canada will now use gender neutral announcements onboard flights simple flying air canad ", "author": "Daniel J. Rowe", "content": "MONTREAL -- Flight attendants at Air Canada will no longer greet passengers as \"ladies and gentlemen\" or \"mesdames et messieurs\" as they have for years.\r\nFlight staff will no longer use gender terms in boarding announcements as the company will be replacing s… [+536 chars]"}, {"title": "nations league recap usa 0 2 canada an abysmal loss up north stars and stripes fc", "description": "nations league recap usa 0 2 canada an abysmal loss up north stars and stripes fc canada vs united states football match report october 15 2019 espn btc usmnt efficient vs cuba in nations league u s soccer canada 2 united states 0 2019 concacaf ", "author": "Parker Cleveland", "content": "The US Mens National Team was back in Nations League action as it looked for its second win of the tournament at BMO Field in Canada. It would not come for the Americans. Rather, Canada was determined to play defensively and try to counter or take advantage o… [+4541 chars]"}, {"title": "air canada will no longer call passengers ladies and gentlemen huffpost canada", "description": "air canada will no longer call passengers ladies and gentlemen huffpost canada view full coverage on google news", "author": "Connor Garel", "content": "Most airlines have shared a similar greeting tradition for decades: a scripted announcement that plays through the overhead speakers after passengers find their seats. But in a newfound effort to be more inclusive, and more conscious of how people identify, A… [+4455 chars]"}, {"title": "new numbers show 29 increase in advance voting over 2015 elections canada global news", "description": "new numbers show 29 increase in advance voting over 2015 elections canada global news snapchat teams up with elections canada to encourage young users to vote ctv news canadian actor fears he may not be able to vote while on musical tour in u s cbc ca abou ", "author": "hannahjacksonglobal", "content": "New numbers released by Elections Canada on Tuesday say voter turnout during the four-day advance polling period was up 29 per cent over numbers recorded ahead of the federal election in 2015.\r\nAccording to Elections Canada, preliminary figures show 4.7 milli… [+2567 chars]"}, {"title": "business outlook survey autumn 2019 bank of canada", "description": "business outlook survey autumn 2019 bank of canada business outlook more rosy overall but prairies still hard hit bank of canada says cbc ca bank of canada outlook suggests uptick in business sentiment business news castanet net bank of canada unlikely to ", "author": null, "content": "The Business Outlook Survey (BOS) indicator is a summary measure that captures common movements from the main BOS questions.2 A variant of the BOS indicator (Chart 1-A, black line) relies on the same BOS questions but at the regional level; thus, the number o… [+1496 chars]"}, {"title": " meghan markle for president et canada", "description": " meghan markle for president et canada princess diana had to stop wearing this popular brand because of prince charles and camilla s affair showbiz cheat sheet what happened to princess diana and why it s not happening to meghan e news kenneth rose s secr ", "author": null, "content": null}, {"title": "canadian men s team s landmark moment within reach after signature win sportsnet ca", "description": "canadian men s team s landmark moment within reach after signature win sportsnet ca canada shock u s what went wrong for the u s major league soccer canada not done after historic win over usmnt it s only one step sporting news canadian men s soccer tea ", "author": "Jeff Blair", "content": "TORONTO — As far as I could tell, the country didnt stop Tuesday night. Too much stuff on right now: serious, political stuff. Hockey. Life as it is in this country in the early days of Fall.\r\nBut for once it seems as if that day may not be far off for the Ca… [+8670 chars]"}, {"title": "can a trudeau minority mend provincial divides power politics cbc news", "description": "can a trudeau minority mend provincial divides power politics cbc news watch alberta premier post federal election commentary edmonton journal canada election liberal victory renews separatist talk in western canada global news fire burning in western ", "author": null, "content": null}, {"title": "canada election trudeau casts his ballot on election day global news", "description": "canada election trudeau casts his ballot on election day global news liberals bracing for losses in atlantic canada as polls open on the east coast ctv news natural resources jobs and taxes in andrew scheer s letter to dwight ball cbc ca the munk debate tha ", "author": null, "content": "Liberal Party Leader Justin Trudeau was joined by his wife, Sophie Grégoire Trudeau, and children as he cast his ballot in his home riding of Papineau on Monday.\r\nFor more info, please go to http://www.globalnews.caSubscribe to Global News Channel HERE: http:… [+271 chars]"}, {"title": "british family traumatized after being detained by us immigration", "description": "a british family has filed a complaint with the the department of homeland security over their detention by us immigration officials after crossing the us border while vacationing in british columbia canada earlier this month the family s lawyers said on tu ", "author": "Geneva Sands, Carma Hassan, Chuck Johnston, Miguel Marquez, Linh Tran and Ivana Kottasová, CNN", "content": "(CNN)A British family has filed a complaint with the the Department of Homeland Security over their detention by US immigration officials after crossing the US border while vacationing in British Columbia, Canada earlier this month, the family's lawyers said … [+3575 chars]"}, {"title": "five things to watch for in the canadian business world in the coming week ctv news", "description": "statistics canada will release its consumer price index and kinder morgan canada hosts one of its last quarterly conference calls as its sale to pembina pipeline is expected to close late in the fourth quarter this week in canadian business ", "author": "The Canadian Press", "content": "TORONTO -- Five things to watch for in the Canadian business world in the coming week:\r\nAphria call\r\nAphria Inc. will hold a conference call to discuss its first-quarter financial results on Monday. Cannabis company Aleafia Health Inc. announced on Oct. 8 tha… [+1659 chars]"}, {"title": "justin trudeau the good news and bad for canada s pm bbc news", "description": "justin trudeau the good news and bad for canada s pm bbc news canada election results live trudeau expected to maintain grip on power in minority government after fraught election against scheer the independent canadian dollar holds near three month h ", "author": "https://www.facebook.com/bbcnews", "content": "Media caption\"Canadians voted in favour of a progressive agenda\" - Justin Trudeau's victory speech\r\nPrime Minister Justin Trudeau has retained power in Canada's election but lost both his majority and - by a slight margin - the popular vote. Here is a breakdo… [+6990 chars]"}, {"title": "2019 advance voting turnout was the highest ever for a canadian election estimates huffpost canada", "description": "2019 advance voting turnout was the highest ever for a canadian election estimates huffpost canada roughly 4 7m ballots cast in advance polls elections canada says cbc ca about one million more people voted in advance polls this year compared to 2015 elect ", "author": "Melanie Woods", "content": "It appears a lot of people had a side of democracy with their turkey this Thanksgiving.\r\nIn a preliminary estimate, Elections Canada says 4.7 million people voted in advance polls on four days over this past long weekend. \r\nThis marks an increase of 29 per ce… [+1176 chars]"}, {"title": "decision to deploy genetically modified mosquitoes not made responsibly researchers say halifaxtoday ca", "description": "decision to deploy genetically modified mosquitoes not made responsibly researchers say halifaxtoday ca", "author": "The Conversation", "content": "This article, written by Natalie Kofler, University of Illinois at Urbana-Champaign; Françoise Baylis, Dalhousie University; Graham Dellaire, Dalhousie University, and Landon J Getz, Dalhousie University, originally appeared on The Conversation and has been r… [+8654 chars]"}, {"title": "scientist faces criticism on red meat study waterloo chronicle", "description": "scientist faces criticism on red meat study waterloo chronicle view full coverage on google news", "author": null, "content": "HALIFAX A Canadian researcher who co-led a study that challenges well-worn advice to limit meat consumption has responded to criticisms he should have disclosed past ties to the global meat and food industry.\r\nDalhousie University's Bradley Johnston said Satu… [+1334 chars]"}, {"title": "study red meat not so bad canada news castanet net", "description": "a canadian researcher who co led a study that challenges well worn advice to limit meat consumption has responded to criticisms he should have disclosed past ties to the global meat and food industry ", "author": null, "content": "A Canadian researcher who co-led a study that challenges well-worn advice to limit meat consumption has responded to criticisms he should have disclosed past ties to the global meat and food industry.\r\nDalhousie University's Bradley Johnston said Saturday tha… [+2269 chars]"}, {"title": "experts say zero tolerance policies aimed at stopping bullying aren t working global news", "description": "experts say zero tolerance policies aimed at stopping bullying aren t working global news zero tolerance policies aimed at stopping bullying not working experts say cbc ca zero tolerance policies aimed at stopping bullying not working say experts ctv news v ", "author": "Michelle McQuigge", "content": "TORONTO – The shocking death of a 14-year-old Ontario boy who was stabbed outside his high school raises questions about the effectiveness of the anti-bullying campaigns that have gained prominence in Canada in recent years, those with expertise in the matter… [+4232 chars]"}, {"title": "should you keep eating red meat jordan times", "description": "by ryan w millershould you stop eating red meat for health reasons that s the question rocking the nutrition and scientific community after guidelines published in a peer reviewed journal said people should continue eating red meat running counter to what m ", "author": null, "content": "By Ryan W. Miller\r\nShould you stop eating red meat for health reasons?\r\nThats the question rocking the nutrition and scientific community after guidelines published in a peer-reviewed journal said people should continue eating red meat, running counter to wha… [+6114 chars]"}, {"title": "do you really need to eat less red meat everyday health", "description": "new guidelines suggest there isn t enough evidence to recommend cutting back on red meat to prevent heart disease diabetes and early death but several scientists disagree with the controversial findings learn more about the analysis here ", "author": "Becky Upham", "content": "One day carbs are okay; the next they're the devil. Fat was the culprit of the obesity epidemic; now, loading up is touted as a quick-fix for weight loss. If you're a health news consumer, you're no stranger to nutrition advice that flip-flops so much it can … [+17229 chars]"}, {"title": "in 2015 justin trudeau declared canada is back so where are we now global news", "description": "in 2015 justin trudeau declared canada is back so where are we now global news in 2019 justin trudeau has baggage and faces a very different political landscape cbc ca jeered and cheered in calgary trudeau spends final day of campaign in b c ctv new ", "author": "Rachel Browne", "content": "Right after Justin Trudeau led the Liberals to a strong victory in the 2015 federal election, he declared that he would also guide Canada back to its rightful place on the global stage in the aftermath of a decade under the Conservatives.\r\nTo this countrys fr… [+15220 chars]"}, {"title": "too much milk two nations travails with dairy policy", "description": "the u s has embraced exports canada keeps them out to manage its milk supply global markets pose a challenge to both ", "author": "Laurent Belsie", "content": "Standing in her barn outside Cambridge, Wisconsin, surrounded by cows with tags in their ears, Tina Hinchley is growing optimistic that the five-year crisis in Americas dairy industry is coming to an end.\r\nWe are not out of the woods yet, she says. But I see … [+7097 chars]"}, {"title": "the green leader s great expectations how elizabeth may nearly quit after 2015 but stayed for a showdown on climate change the globe and mail", "description": "the green leader s great expectations how elizabeth may nearly quit after 2015 but stayed for a showdown on climate change the globe and mail elizabeth may says minority government likely on monday cbc ca green leader elizabeth may predicts canadians will e ", "author": null, "content": "Green Leader Elizabeth May arrives for a federal election campaign stop via public transit in Longueuil, Que., on Oct. 8, 2019.\r\nThe Canadian Press\r\nElizabeth May is in the middle of her fourth federal election campaign as Leader of the Green party, and this … [+23147 chars]"}, {"title": "better battery management through chemistry", "description": "the lead acid rechargeable battery is a not quite modern marvel super reliable and easy to use charging it is just a matter of applying a fixed voltage to it and waiting a while eventually the battery is charged and stays topped off and that s it their e ", "author": "Bob Baddeley", "content": "The lead-acid rechargeable battery is a not-quite-modern marvel. Super reliable and easy to use, charging it is just a matter of applying a fixed voltage to it and waiting a while; eventually the battery is charged and stays topped off, and that’s it. Their e… [+8975 chars]"}, {"title": " ", "description": " bbc james gallagher ", "author": "BBC News 中文", "content": "54002\r\nDalhousie UniversityMcMaster University\r\nAnnals of Internal Medicine1000\r\n1000\r\n·Bradley JohnstonBBC\r\n·Kevin McConway\r\n·David Spiegelhalter\r\nBBC\r\n·Marco Springmann\r\n·Giota Mitrou\r\n·Nita Forouhi2\r\n100010212\r\n1006\r\n501007\r\nNational Health Service, NHS907… [+23 chars]"}, {"title": "from dementia to medically assisted death a canadian woman s journey and the dilemma of the doctors who helped the globe and mail", "description": "to give alzheimer s patient mary wilson the death she sought her physicians had to make a tough decision in a short time and risked going to prison if they got it wrong now they ve been cleared of wrongdoing in a decision that could have wide reaching imp ", "author": null, "content": "Mary Wilson is shown with her daughter Kira Campbell in 2012, a year before Ms. Wilson was diagnosed with Alzheimer's disease.\r\nHandout\r\nThe speech pathologist turned to Mary Wilson and gestured toward her husband of 52 years.\r\nWhos that? the pathologist aske… [+20808 chars]"}, {"title": "corals destroyed by climate change can regrow from the skeletons left behind", "description": "experts from the free university of berlin and the university of barcelona monitored 243 colonies of corals in the mediterranean sea across a period of 16 years ", "author": "By Ian Randall For Mailonline", "content": "On land, heatwaves can be deadly for humans and wildlife and can devastate crops and forests.\r\nUnusually warm periods can also occur in the ocean. These can last for weeks or months, killing off kelp forests and corals, and producing other significant impacts… [+6069 chars]"}, {"title": "put down the self help books resilience is not a diy endeavour", "description": "research shows that resilience depends more on what we receive than what we have within us", "author": "Michael Ungar", "content": "Illustration by Xulin Wang\r\nMichael Ungar is the Canada Research Chair in Child, Family and Community Resilience, a professor of social work at Dalhousie University and a family therapist. He is the author of more than a dozen books, including Change Your Wor… [+22447 chars]"}, {"title": "tesla neemt canadese accufabrikant hibar systems over", "description": "tesla heeft hibar systems overgenomen een canadese fabrikant van accu s voor elektrische voertuigen laptops en andere toepassingen de acquisitie versterkt de vermoedens dat tesla zelf in de accucelproductie gaat stappen om minder afhankelijk te zijn van a ", "author": "Michel van der Ven", "content": "Tesla heeft Hibar Systems overgenomen, een Canadese fabrikant van accus voor elektrische voertuigen, laptops en andere toepassingen. De acquisitie versterkt de vermoedens dat Tesla zelf in de accucelproductie gaat stappen, om minder afhankelijk te zijn van an… [+1449 chars]"}, {"title": "a million mile electric car battery musk wasn t lying", "description": "when earlier this year tesla s elon musk said the company could soon have batteries lasting for over one million miles many probably took it as yet another grand promise with less substance than realism requires now it seems musk may the post a million mi ", "author": "Irina Slav", "content": "When earlier this year Teslas Elon Musk said the company could soon have batteries lasting for over one million miles, many probably took it as yet another grand promise with less substance than realism requires. Now it seems Musk may have not been exaggerati… [+3135 chars]"}, {"title": "we need to understand the culture of whales so we can save them", "description": "do animals have their own culture a researcher studying whales argues that they do", "author": "Felicia Vachon", "content": "We often think of culture as solely human. We think of our music, our clothes, our food, our languages. However, culture stretches far beyond Homo sapiens. As evidence of the existence of culture in other animal groups emerges (from insects, rats, fish to lan… [+5775 chars]"}, {"title": "tesla buys ontario based battery manufacturing company hibar systems", "description": "tesla has quietly bought the richmond hill ontario battery manufacturing company hibar systems to use its knowledge in battery manufacturing public records show that the ev manufacturer bought the battery company sometime between july and october of 2019 a ", "author": "Brad Bennett", "content": "Tesla has quietly bought the Richmond Hill, Ontario battery manufacturing company Hibar Systems to use its knowledge in battery manufacturing.\r\nPublic records show that the EV manufacturer bought the battery company sometime between July and October of 2019, … [+2042 chars]"}, {"title": "why is this online banking security feature common in other countries but not canada ", "description": "some experts say canada is lagging behind other countries when it comes to online banking security ", "author": "Yvonne Colbert", "content": "Google offers it, some video games require it, but three of Canada's big five banks don't even want to talk about two-factor authentication (2FA), an extra layer of online security that some experts say banks should be required to provide to help protect cons… [+5119 chars]"}, {"title": "tesla adds hibar systems to its list of acquisitions", "description": "with no public announcement or fanfare tesla has acquired hibar systems of toronto a company that specializes in advanced battery manufacturing techniques ", "author": "Steve Hanley", "content": "BatteriesPublished on October 6th, 2019 |\r\n by Steve Hanley\r\n0\r\nOctober 6th, 2019 by Steve Hanley \r\nHibar Systems, with headquarters in Ontario, was founded in the 1970s by German-Canadian engineer Heinz Barall. Since then, it has established itself as a lead… [+3218 chars]"}, {"title": "howard university and amazon want to diversify the entertainment industry", "description": "howard university and amazon studios are working together to diversify the entertainment industry today they announced howard entertainment a program that will give african american latinx and native american students a chance to study and train alongside ", "author": "Christine Fisher", "content": "The new program will send students to Los Angeles for two semesters, the second of which will include a fellowship in the industry. Students interested in all aspects of entertainment -- project greenlighting, PR and marketing, entertainment law and finance -… [+751 chars]"}, {"title": "the first u s clinical trial of using an in brain chip to fight opioid addiction is now underway", "description": "opioid addiction is easily one of the top widespread healthcare issues facing the u s and research indicates we re nowhere near achieving any kind of significant mitigating solution but a team of medical researchers working at the west virginia university ", "author": "Darrell Etherington", "content": "Opioid addiction is easily one of the top widespread healthcare issues facing the U.S., and research indicates we’re nowhere near achieving any kind of significant mitigating solution. But a team of medical researchers working at the West Virginia University … [+1994 chars]"}, {"title": "how to protect your smart speaker from a laser attack", "description": "i love a good scientific mystery stuff like quantum weirdness dark matter and dark energy strange gravitational behavior or even why smart speakers respond to light waves as if they were sound that last one was the topic of a recently published paper from ", "author": "Brendan Hesse", "content": "I love a good scientific mysterystuff like quantum weirdness, dark matter and dark energy, strange gravitational behavior, or even why smart speakers respond to light waves as if they were sound. That last one was the topic of a recently published paper from … [+3607 chars]"}, {"title": "mark zuckerberg took on china in a speech defending free expression", "description": "in a speech at georgetown university on october 17th facebook ceo mark zuckerberg drew a sharp contrast with chinese companies like tiktok owner bytedance ", "author": "Russell Brandom", "content": "Is that the internet that we want?\r\nIn a speech at Georgetown University on Thursday, Mark Zuckerberg laid out Facebooks approach to moderation in terms of an ongoing commitment to free expression and in one particular section, drew a sharp contrast with Chin… [+3313 chars]"}, {"title": "penn state investigates new allegations against jerry sandusky", "description": "penn state university is investigating a new allegation of abuse by convicted child molester and former assistant football coach jerry sandusky a university spokesperson told cnn thursday ", "author": "Julia Jones, CNN", "content": "(CNN)Penn State University is investigating a new allegation of abuse by convicted child molester and former assistant football coach Jerry Sandusky, a university spokesperson told CNN Thursday. \r\nWyatt DuBois said an incident report was filed on Tuesday with… [+1982 chars]"}, {"title": "this 3d food printer cooks its prints with a laser good algorithms", "description": "researchers at columbia university are leading the food 3d printing revolution by using food printers and lasers to cook food read more more about mashable video 3d printing lasers columbia university and 3d food printer", "author": "Danica D'Souza", "content": null}, {"title": "mark zuckerberg on lies in political ads i don t think it s right for a private company to censor politicians ", "description": "facebook s ceo mark zuckerberg rallied people around the first amendment during a live speech at georgetown university he defended the company s policy of letting politicians lie in political ads ", "author": "Zoe Schiffer", "content": "Facebooks CEO rallies people around the First Amendment\r\nIllustration by James Bareham / The Verge\r\nMark Zuckerberg defended Facebooks policy of letting politicians lie in political ads along with free speech more broadly in a speech today at Georgetown Unive… [+2146 chars]"}, {"title": "physicists win nobel prize for finding exoplanet around a sun like star and for helping develop theory of the universe", "description": "the 2019 physics nobel prize will be awarded half to james peebles of princeton university and half jointly to michel mayor and didier queloz of the university of geneva in switzerland for theoretical work improving our understanding of the universe and for ", "author": "Ryan F. Mandelbaum", "content": "The 2019 Physics Nobel Prize will be awarded half to James Peebles of Princeton University, and half jointly to Michel Mayor and Didier Queloz of the University of Geneva in Switzerland, for theoretical work improving our understanding of the universe and for… [+5502 chars]"}, {"title": "report university of iowa faculty told not to promote greta thunberg visit on school social media", "description": "university of iowa officials have told faculty at the school that they should not promote 16 year old swedish environmental activist great thunberg s surprise appearance at a friday climate strike in iowa city on its social media channels according to a repo ", "author": "Tom McKay on Earther, shared by Tom McKay to Gizmodo", "content": "University of Iowa officials have told faculty at the school that they should not promote 16-year-old Swedish environmental activist Great Thunbergs surprise appearance at a Friday climate strike in Iowa City on its social media channels, according to a repor… [+3289 chars]"}, {"title": "lori loughlin s daughters are no longer enrolled at usc university says", "description": "lori loughlin s daughters are no longer enrolled at the university of southern california the school said in a statement to cnn on monday ", "author": "Amir Vera, CNN", "content": "(CNN)Lori Loughlin's daughters are no longer enrolled at the University of Southern California, the school said in a statement to CNN on Monday.\r\n\"Olivia Jade Giannulli and Isabella Rose Giannulli are not currently enrolled,\" the statement from the USC regist… [+757 chars]"}, {"title": "oxford professor is accused of selling ancient texts to hobby lobby", "description": "an investigation found that bible fragments in a museum started by the owners of the arts and crafts chain had been illegally taken from the university ", "author": "Anna Schaverien", "content": "But Stephen Rouse, an Oxford spokesman, said Wednesday that the professor was still employed by the university.\r\nMr. Rouse said in a statement that the university was working with the Egypt Exploration Society and was also conducting its own internal investig… [+810 chars]"}, {"title": "we re not ready for the next pandemic", "description": "if the seeds of a pandemic illness were planted tomorrow how would the world fare well according to a simulation carried out on friday by johns hopkins university the answer is terribly read more ", "author": "Ed Cara", "content": "If the seeds of a pandemic illness were planted tomorrow, how would the world fare? Well, according to a simulation carried out on Friday by Johns Hopkins University, the answer is: terribly.\r\nAt a hotel near New York Citys Central Park, the Johns Hopkins Cen… [+4149 chars]"}, {"title": "news icon trump base will follow him to hell and won t budge", "description": "former abc news anchor sam donaldson reacts to a new impeachment poll from quinnipiac university showing public opinion over whether president donald trump should be removed from office ", "author": null, "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"title": "beer here merchandising of college sports leads to team branded ales", "description": "the university of louisiana at lafayette and more than 20 universities license their own brands of beer those deals seem like no brainers but they come as the n c a a grapples with letting athletes strike their own ", "author": "Billy Witz", "content": "Early in the summer of 2015, Knott received a call from a local beer distributor saying that Louisiana-Lafayette was interested in branding its own beer and was looking for someone to make it. So Knott arranged four samples for Tarver and several others to ta… [+1267 chars]"}, {"title": "coda biotherapeutics is developing a cure for pain", "description": "if the researchers executives and investors behind coda biotherapeutics have their way one day soon there really could be a cure for pain co founded by researchers joseph glorioso from the university of pittsburgh s microbiology and molecular genetics dep ", "author": "Jonathan Shieber", "content": "If the researchers, executives and investors behind Coda Biotherapeutics have their way, one day soon there really could be a cure for pain.\r\nCo-founded by researchers Joseph Glorioso, from the University of Pittsburgh’s microbiology and molecular genetics de… [+4366 chars]"}, {"title": "don valentine who founded sequoia capital has died at age 87", "description": "sequoia capital founder don valentine passed way at his home in woodside ca today at age 87 of natural causes sequoia posted a tribute to valentine shortly afterward calling him one of a generation of leaders who forged silicon valley a native of new ", "author": "Connie Loizos", "content": "Sequoia Capital founder Don Valentine passed way at his home in Woodside, Ca., today at age 87 of natural causes.\r\nSequoia posted a tribute to Valentine shortly afterward, calling him “one of a generation of leaders who forged Silicon Valley.”\r\nA native of Ne… [+2593 chars]"}, {"title": "pioneers of lithium ion batteries win the 2019 nobel prize in chemistry", "description": "this year s nobel prize in chemistry has been awarded to three scientists credited with the invention of the rechargeable lithium ion battery john b goodenough of the university of texas at austin m stanley whittingham of binghamton university and akira yos ", "author": "Rachel England", "content": "Rechargeable lithium-ion batteries can be found in pretty much everything from mobile phones to electric vehicles, and can store significant amounts of energy from solar and wind power. Given their prominent place in everyday life, and the fact that they were… [+1330 chars]"}, {"title": "texas a m commerce police say there was an incident outside greenville that may or not have involved students ", "description": "following reports of a shooting early sunday morning the texas a m university commerce police department tweeted there was an event outside greenville texas that may or not have involved students at this time ", "author": "Amanda Watts, CNN", "content": "(CNN)Following reports of a shooting early Sunday morning, the Texas A&amp;M University-Commerce Police Department tweeted there was an event outside Greenville, Texas, that \"may or not have involved students at this time.\"\r\nThere was no active shooter in Com… [+839 chars]"}, {"title": "students burn books after diversity lecture", "description": "students at georgia southern university burned the books of cuban american author jennine cap crucet on a grill following a lecture in which she argued with participants about white privilege and diversity ", "author": null, "content": "Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."}, {"title": "is artificial intelligence the ultimate university stimulus ", "description": "what does it take to make the university the best learning experience in the lifecycle of one s education higher education is all about developing skills exploring new theories and applying them to the actualities of real life throughout this journey stu ", "author": "Dmytro Spilka", "content": "What does it take to make the university the best learning experience in the lifecycle of one’s education? Higher education is all about developing skills, exploring new theories, and applying them to the actualities of real life. Throughout this journey, stu… [+8369 chars]"}, {"title": "halifax police arrest 18 extinction rebellion protesters at macdonald bridge ctv news", "description": "more than a dozen people were arrested and released following a planned protest that prompted the closure of the macdonald bridge which links halifax and dartmouth monday morning ", "author": "Digital Producer", "content": "More than a dozen people were arrested and released following a planned protest that prompted the closure of the Macdonald Bridge, which links Halifax and Dartmouth, Monday morning.\r\nThere was a heavy police presence on the Dartmouth side of the bridge for th… [+5802 chars]"}, {"title": "a gus modern x luum textiles mashup that creates playful results", "description": "gus modern launched a collection with luum textiles that reimagines the halifax chair and porter end table with new colorways based on lumm s knurl fabric ", "author": "Caroline Williamson", "content": "Canadian furniture favorites Gus* Modern just launched a limited edition collection with LUUM Textiles that resulted in delightful color combinations. The collaboration reimagines the Gus* Modern Halifax Chair and Porter End Table with three new colorways cen… [+344 chars]"}, {"title": "man falls off macdonald bridge after slow speed chase with police ctv news", "description": "man falls off macdonald bridge after slow speed chase with police ctv news view full coverage on google news", "author": "THE CANADIAN PRESS", "content": "HALIFAX -- Nova Scotia's police watchdog is investigating after a 29-year-old man fell to his death from a Halifax bridge following a \"slow-speed pursuit\" involving municipal officers.\r\nThe Serious Incident Response Team, or SIRT, confirmed Monday it's invest… [+1149 chars]"}, {"title": "yale astrophysicist to talk in halifax tonight about changing ideas of our universe truro daily news", "description": "the washington post calculates that the leader of priyamvada natarajan s country had made 13 435 false or misleading claims as of oct 9 in this climate of fact denial and fake news it s more important than ever to", "author": "John McPhee", "content": "The Washington Post calculates that the leader of Priyamvada Natarajan’s country had made 13,435 false or misleading claims as of Oct. 9.\r\nIn this climate of fact-denial and “fake news,” it’s more important than ever to stand up for evidence-based thinking, t… [+3732 chars]"}, {"title": "72 female mps sign open letter condemning colonial media coverage of meghan markle", "description": "72 female politicians in the uk have written an open letter to meghan markle pledging their solidarity with her as she and prince harry take a stand against several british media outlets holly lynch mp labour mp for halifax tweeted an image of the letter ", "author": "Rachel Thompson", "content": "72 female politicians in the UK have written an open letter to Meghan Markle pledging their solidarity with her as she and Prince Harry take a stand against several British media outlets. \r\nHolly Lynch MP Labour MP for Halifax tweeted an image of the letter, … [+2162 chars]"}, {"title": "power outages fallen trees as maritimes rocked by strong fall storm ctv news", "description": "power outages fallen trees as maritimes rocked by strong fall storm ctv news thousands of maritimers without power as storm brings high winds heavy rain global news weather bomb hits n s with power outages downed trees flooding cbc ca view full coverag ", "author": "Michael Tutton", "content": "HALIFAX -- Thousands of Maritimers lost power on Thursday as a slow-moving fall storm crawled through the region, bringing downpours, powerful gusts and toppled trees.\r\nForecasters said sustained winds of about 60 kilometres per hour hit parts of Nova Scotia,… [+1993 chars]"}, {"title": "updated province of nova scotia bans street checks thechronicleherald ca", "description": "updated province of nova scotia bans street checks thechronicleherald ca head of n s prosecution service says bill ending arbitration a disaster halifaxtoday ca projects aimed at preventing sexual violence on n s campuses get funding cbc ca legal experts ", "author": "Andrew Rankin", "content": "HALIFAX, N.S. — Lynn Jones saw the ban as a particular victory for the leaders of her community who simply refused to tolerate police street checks. \r\nJustice Minister Mark Furey’s announcement on Friday to move what was a temporary moratorium on street check… [+4002 chars]"}, {"title": "blue green algae risk advisory for lake micmac has been lifted halifaxtoday ca", "description": "blue green algae risk advisory for lake micmac has been lifted halifaxtoday ca", "author": "HalifaxToday Staff", "content": "NEWS RELEASEHALIFAX REGIONAL MUNICIPALITY*************************The Halifax Regional Municipality is advising residents that the blue-green algae risk advisory previously in effect for Lake Micmac in Dartmouth has been lifted.\r\nThe off-leash dog area of Shu… [+1455 chars]"}, {"title": "scientist faces criticism on red meat study waterloo chronicle", "description": "scientist faces criticism on red meat study waterloo chronicle view full coverage on google news", "author": null, "content": "HALIFAX A Canadian researcher who co-led a study that challenges well-worn advice to limit meat consumption has responded to criticisms he should have disclosed past ties to the global meat and food industry.\r\nDalhousie University's Bradley Johnston said Satu… [+1334 chars]"}, {"title": "liberals bracing for losses in atlantic canada as polls open on the east coast ctv news", "description": "liberals bracing for losses in atlantic canada as polls open on the east coast ctv news natural resources jobs and taxes in andrew scheer s letter to dwight ball cbc ca hundreds in calgary attend justin trudeau rally edmonton journal how justin trudeau and a ", "author": "Michael MacDonald", "content": "HALIFAX -- Four years after Atlantic Canadians gave Justin Trudeau a sweeping electoral endorsement -- handing his Liberals all 32 of the region's seats -- the party is bracing for losses that could have a significant impact on the final tally later tonight.\r… [+3201 chars]"}, {"title": "options being pursued with suspension of cancer care traveling clinics to yarmouth and new glasgow saltwire network", "description": "options being pursued with suspension of cancer care traveling clinics to yarmouth and new glasgow saltwire network options being pursued with suspension of cancer care traveling clinics to yarmouth and new glasgow the news the news view full coverage on go ", "author": "Tina Comeau", "content": "YARMOUTH, N.S. — Cancer Care Nova Scotia is hoping a suspension of cancer clinics in Yarmouth and New Glasgow – due to the unavailability of oncologists to travel – will be a short-term situation.In the meantime, with patients now having to drive to Halifax, … [+5618 chars]"}, {"title": "what s coming and going from netflix in november 2019", "description": "this month netflix gets billy on the street fear and loathing in las vegas grease rosemary s baby step brothers the game the full matrix trilogy last seen on netflix june 30 and zombieland read more ", "author": "Nick Douglas", "content": "This month, Netflix gets Billy on the Street, Fear and Loathing in Las Vegas, Grease, Rosemarys Baby, Step Brothers, The Game, the full Matrix trilogy (last seen on Netflix June 30), and Zombieland.\r\nIn original series, theres a new Japan edition of Queer Eye… [+4370 chars]"}, {"title": "the surprisingly boring road to self driving cars", "description": "at last it is here the truly self driving car no human behind the wheel for the public a few hundred of them in a closed beta in a small corner of sun drenched never snow drenched almost never water drenched suburban phoenix five years later than ", "author": "Jon Evans", "content": "At last, it is here! The truly self-driving car, no human behind the wheel! For the public! …A few hundred of them, in a closed beta, in a small corner of sun-drenched (never snow-drenched, almost never water-drenched) suburban Phoenix, five years later than … [+5252 chars]"}, {"title": "the grim story of the mackay bennett the titanic s mortuary ship", "description": "when the supposedly unsinkable titanic went down on april 15 1912 the halifax based ship mackay bennett was assigned to recover its victims ", "author": "Claire Cock-Starkey", "content": "Kitty ONeil could do it all. A stuntwoman, drag racer, and diver, the legendary daredevil's skills were once described by the Chicago Tribune as full and partial engulfment in fire; swimming; diving; water skiing; scuba diving; horse falls, jumps, drags, and … [+7781 chars]"}, {"title": "the grim story of the mackay bennett the titanic s mortuary ship", "description": "when the supposedly unsinkable titanic went down on april 15 1912 the halifax based ship mackay bennett was assigned to recover its victims ", "author": "Claire Cock-Starkey", "content": "At 11:40 p.m. on April 14, 1912, the RMS Titanic hit an iceberg about 375 miles off the coast of Newfoundland, Canada. The supposedly unsinkable ocean liner was four days into her journey from Southampton, England, to New York when the call to abandon ship ra… [+6159 chars]"}, {"title": "study red meat not so bad canada news castanet net", "description": "a canadian researcher who co led a study that challenges well worn advice to limit meat consumption has responded to criticisms he should have disclosed past ties to the global meat and food industry ", "author": null, "content": "A Canadian researcher who co-led a study that challenges well-worn advice to limit meat consumption has responded to criticisms he should have disclosed past ties to the global meat and food industry.\r\nDalhousie University's Bradley Johnston said Saturday tha… [+2269 chars]"}, {"title": "1 dead 3 missing in new orleans building collapse global news", "description": "1 dead 3 missing in new orleans building collapse global news 1 dead 3 missing after hotel collapse in new orleans ctv news 1 dead and 3 missing in new orleans hotel collapse cbc ca udpate collapse of new orleans hard rock hotel under construction wgno new ", "author": "David Lao", "content": "One person has died and another three are missing after the upper part of a building collapsed in New Orleans, according to authorities.\r\nThe upper six to eight floors of the Hard Rock Hotel, which had been under construction for several months, came crashing… [+2112 chars]"}, {"title": "a week in halifax ns on a 52 000 salary", "description": "welcome to money diaries where we re tackling what might be the last taboo facing modern working women money we re asking millennials how they spend their hard earned money during a seven day period and we re tracking every last dollar attention canadi ", "author": "You, also written by You", "content": "10 p.m. My friend pours me a glass of wine. Some of our other pals come over, and we chat and play with my friend's dogs. She loans me a copy of Priestdaddy by Patricia Lockwood, and I'm looking forward to curling up in bed and reading. I get a ride home. 11:… [+271 chars]"}, {"title": "tories and ndp put dent in liberal dominance of atlantic provinces ctv news", "description": "tories and ndp put dent in liberal dominance of atlantic provinces ctv news canadian election results 2019 a live riding by riding map of the vote national post over to you canada maclean s editorial a divided canada on election day toronto sun how justin t ", "author": "The Canadian Press", "content": "HALIFAX -- Atlantic Canada's once monochromatic electoral map, awash in Liberal red since 2015, received a slight makeover Monday as the Tories, NDP and Greens punched holes in the Liberals' East Coast fortress.\r\nFour years ago, voters across the region hande… [+2861 chars]"}, {"title": "appropriate exercise can benefit those recovering from cancer treatments thechronicleherald ca", "description": "one in two canadians will be diagnosed with some kind of cancer in their lifetime in previous years a cancer diagnosis was accompanied by a prescription to rest as much as possible and to limit any kind of physical activity", "author": "Joy Chiekwe", "content": "One in two Canadians will be diagnosed with some kind of cancer in their lifetime. In previous years, a cancer diagnosis was accompanied by a prescription to rest as much as possible and to limit any kind of physical activity to a bare minimum. Though that ma… [+3276 chars]"}, {"title": "armenia and the technology of diaspora", "description": "it s a tough world out there for small countries technology is the future everyone knows that but how do you claim your share of that future when you re competing with america china the eu and india how do you build a thriving ecosystem of tech wealth ", "author": "Jon Evans", "content": "It’s a tough world out there for small countries. Technology is the future, everyone knows that; but how do you claim your share of that future when you’re competing with America, China, the EU, and India?\r\nHow do you build a thriving ecosystem of tech wealth… [+3095 chars]"}, {"title": "hundreds of ontario schools will remain open after deal struck between province union ctv news", "description": "hundreds of ontario schools will remain open after deal struck between province union ctv news ontario government and cupe workers reach deal avoid school strike huffpost canada hundreds of ontario schools will remain open after deal struck between province ", "author": "Shawn Jeffords and Nicole Thompson", "content": "TORONTO -- A strike that would have closed hundreds of schools across Ontario was averted Sunday night as the province reached a tentative deal with the union representing thousands of education workers.\r\nEducation Minister Stephen Lecce and the bargaining un… [+4394 chars]"}, {"title": "the toronto restaurant with a secret sake menu", "description": "for some chefs owning and operating a successful restaurant is achievement enough but for mitch bates owner of upscale toronto restaurant grey gardens food and drink are never something you can stop learning about ", "author": "Lilit Marcus", "content": "(CNN) For some chefs, owning and operating a successful restaurant is achievement enough.\r\nBut for Mitch Bates, owner of upscale Toronto restaurant Grey Gardens, food and drink are never something you can stop learning about.\r\nThe American-born chef honed his… [+1539 chars]"}, {"title": "canadian therapist gives up license after satanists expose her mind control talks", "description": "activists with the satanic temple say a now former therapist in canada has been pushing conspiracies about globe spanning mind controlling cults for years and after they exposed some of her professional talks to her licensing board she voluntarily gave up ", "author": "Ed Cara", "content": "Activists with The Satanic Temple say a now-former therapist in Canada has been pushing conspiracies about globe-spanning, mind-controlling cults for years. And after they exposed some of her professional talks to her licensing board, she voluntarily gave up … [+11388 chars]"}, {"title": "mother of slain hamilton teen says everyone failed her son the globe and mail", "description": "mother of slain hamilton teen says everyone failed her son the globe and mail grieving hamilton mom says everyone failed her bullied son canada news castanet net hamilton high school stabbing victim just wanted people to be happy thespec com best frie ", "author": "Michelle McQuigge", "content": "Shari-Ann Bracci-Selvey, centre, fights back tears at a vigil for her 14-year-old murdered son, Devan Selvey, at his high school, Sir Winston Churchill Secondary School, in Hamilton, Ont., on Oct. 9, 2019. \r\nThe Canadian Press\r\nA mother who witnessed her son … [+3708 chars]"}, {"title": "canada election what federal leaders have pledged on the economy global news", "description": "canada election what federal leaders have pledged on the economy global news what s more cringeworthy than one video about trudeau s blackface two videos maclean s elections canada contradicts scheer s claim that ruling was issued in support of conservativ ", "author": "Staff", "content": "Federal parties vying for victory on Oct. 21 are making a range of promises on how they will better the economy.\r\nLiberal Leader Justin Trudeau, the Conservatives Andrew Scheer, New Democrat Jagmeet Singh, Bloc Québécois Leader Yves-François Blanchet and the … [+9525 chars]"}, {"title": "trudeau says offensive posts made by n s candidate unacceptable but will allow him to run global news", "description": "trudeau says offensive posts made by n s candidate unacceptable but will allow him to run global news trudeau won t remove liberal candidate for racist sexist social media posts cbc ca trudeau won t expel candidate who made sexist homophobic racist rem ", "author": "David Lao", "content": "Liberal Leader Justin Trudeau says he will continue to allow a Nova Scotia candidate to run despite offensive online comments he made in the past.\r\nDuring a campaign stop Sunday, Trudeau said the social media posts were “unacceptable,” but that he was pleased… [+2811 chars]"}, {"title": "kids across the country take part in mock vote cbc ca", "description": "kids across the country take part in mock vote cbc ca mock student vote elects liberal minority government ndp opposition global news view full coverage on google news", "author": "https://www.facebook.com/cbckidsca", "content": "When Nicole Miller discovered some of her closest friends didn’t care about the federal election, she wanted to help them understand why it’s important.\r\n“I’ve asked a lot of kids in the hallways and most of them are like no, they’re not interested in voting … [+3288 chars]"}, {"title": "western canada kenney fulfills promise of restraint with budget and goes further the globe and mail", "description": "western canada kenney fulfills promise of restraint with budget and goes further the globe and mail why alberta s corporate tax cut might not keep investment at home cbc ca bob layton budgeting for a surprise global news will a corporate tax cut trickle d ", "author": null, "content": "Good morning! Its James Keller in Calgary.\r\nAlberta Premier Jason Kenney had been foreshadowing this since before he was elected: his governments first budget would be a tough one.\r\nDuring the spring election campaign, Mr. Kenney said a United Conservative go… [+8875 chars]"}, {"title": "factbox key seats to watch in canada s federal election", "description": "as canadians head to polls on monday prime minister justin trudeau s liberals are neck and neck with andrew scheer s conservative party in national opinion polls the new democratic party ndp led by jagmeet singh and the green party led by elizabeth may ar ", "author": "Reuters Editorial", "content": "TORONTO (Reuters) - As Canadians head to polls on Monday, Prime Minister Justin Trudeau’s Liberals are neck-and-neck with Andrew Scheer’s Conservative Party in national opinion polls. The New Democratic Party (NDP) led by Jagmeet Singh and the Green Party led… [+5539 chars]"}, {"title": "aphria inc announces second consecutive quarter of profitability and positive adjusted ebitda canada newswire", "description": "net income increases 4 5 and adjusted ebitda increases four fold from the prior quarter adult use cannabis revenue increases 8 from prior quarter maintains ", "author": null, "content": "Net Income Increases 4.5% and Adjusted EBITDA Increases Four-fold from the Prior QuarterAdult-Use Cannabis Revenue Increases 8% from Prior QuarterMaintains Strong Balance Sheet and Cash Position to Support Future Growth Reiterates Fiscal Year 2020 Outlook\r\nLE… [+27878 chars]"}, {"title": "brace for the flu this season could be a rough one ctv news", "description": "brace for the flu this season could be a rough one ctv news flu shot season ramping up in kenora daily miner and news instagram post falsely says flu shot causes fetal death politifact county schools receive flu vaccinations news parker pioneer view full c ", "author": "Staff", "content": "Flu season begins this week with an aggressive effort to convince Ontarians to get the flu vaccine.\r\nOntarios Health Ministry, the provinces doctors, and Ottawa Public Health will begin Wednesday with a vaccine hesitancy and public education campaign.\r\nAnti-v… [+1329 chars]"}, {"title": "wealth management innovators meet 7 people shaking up recruiting tech and education in the 49 trillion business of managing money", "description": "the wealth management industry s evolution is dizzying technology is changing the lives of advisers and clients while a new generation of investors grows accustomed to some firms dirt cheap financial advice trading and investing options at the same time ", "author": "Rebecca Ungarino", "content": null}, {"title": "the ukrainian orphan at the center of an adoption scandal says she s a teenager and none of her adoptive parents claims are true", "description": "natalia grace barnett and the couple with whom she now lives sat down with dr phil for an interview airing on thursday natalia who has a rare form of dwarfism that makes it difficult to gauge her age was thought to be somewhere between 6 and 8 when michae ", "author": "Kelly McLaughlin", "content": "The Ukrainian orphan at the center of an adoption scandal in Indiana is breaking her silence this week in an interview with Dr. Phil.\r\nNatalia Grace Barnett and the couple who she now lives with sat down with Dr. Phil for a segment airing on Thursday. Through… [+1438 chars]"}, {"title": "greta thunberg inspires massive turnout at edmonton climate rally ctv news", "description": "greta thunberg inspires massive turnout at edmonton climate rally ctv news greta thunberg leads climate strike at alberta legislature calgary herald alberta truck convoy plans counter protest to climate rally with greta thunberg cbc ca climate activists oil ", "author": "Kelsey Dyer", "content": "EDMONTON -- Protesters on both sides of the climate change debate descended on downtown Edmonton as a high-profile activist came to town.\r\nGreta Thunberg arrived in Edmonton Friday for the Strike for Climate Action. The march began at Beaver Hills House Park … [+2544 chars]"}, {"title": "change approach to diagnosing autism to ease wait times stress doctor the chronicle journal", "description": "change approach to diagnosing autism to ease wait times stress doctor the chronicle journal canadian doctor urges flexible diagnostic approach to autism to reduce wait times global news autism diagnosis procedure should be reformed to ease wait times and st ", "author": "Camille Bains The Canadian Press", "content": "VANCOUVER - Lindsay Roberts is home-schooling her son, not by choice but because the five-year-old boy would be prone to hitting people, screaming and suddenly running away if he became overstimulated in a classroom without any support.\r\n\"My little guy couldn… [+4562 chars]"}, {"title": "looking to the future with ids20 20", "description": "ids toronto is going to bring a future forward vision to its 20th edition of the show in january 2020 with the theme ids20 20 ", "author": "Vy Tran", "content": "Next year, the Interior Design Show (IDS) in Toronto is going to bring a future-forward vision to its 20th edition of the show with the theme IDS20/20, which will focus on changing the world through design. IDS Toronto will take place at Metro Toronto Convent… [+1925 chars]"}, {"title": "here s what you need to know about dementia and ways to reduce your risk victoria news", "description": " p research indicates there are things we can do to reduce the risk of developing dementia p ", "author": "Wire Service", "content": "According to Alzheimer’s Disease International’s survey on attitudes toward dementia – which surveyed almost 70,000 people in 155 countries, including Canada – almost 80 per cent of people are concerned about developing dementia, while one in four people thin… [+3555 chars]"}, {"title": "federal leaders spar over climate tax cuts in english language debate the globe and mail", "description": "federal leaders spar over climate tax cuts in english language debate the globe and mail watch live 2019 canadian election leaders debate global news debate intense as leaders clash on climate immigration and bill 21 cbc ca goldstein it s disgusting that ", "author": "Mia Rabson, Joan Bryden", "content": "Justin Trudeau and Andrew Scheer face off during the leaders' debate in Gatineau, Que., on Monday, Oct. 7, 2019.\r\nSean Kilpatrick/The Canadian Press\r\nThe only English-language debate to feature all six federal party leaders devolved Monday into crosstalk and … [+9363 chars]"}, {"title": "a woman who claims she s the ukrainian orphan s biological mom says the girl is a child", "description": "daily mail tv found a woman claiming to be the birth mother of natalia barnett an orphan at the center of an adoption scandal in indiana anna volodymyrivna gava told daily mail tv that she was forced to give up natalia 16 years ago when the girl was an inf ", "author": "Kelly McLaughlin", "content": "A Ukrainian woman claiming to be the birth mother of an orphan at the center of an adoption scandal in Indiana says her daughter is definitely a child, despite her adoptive parents claiming she is a mentally disturbed adult who terrorized their family.\r\nNatal… [+3558 chars]"}]